balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F87K22.PIC
      <edc:DCRDef edc:access="nnnnn--n" edc:cname="CONFIG3L" edc:default="0xf9" edc:desc="" edc:impl="0xf9" edc:name="CONFIG3L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xf9">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="RTCOSC" edc:desc="RTCC Clock Select" edc:mask="0x1" edc:name="RTCOSC" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="SOSCREF" edc:desc="RTCC uses SOSC" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="INTOSCREF" edc:desc="RTCC uses INTRC" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="EASHFT" edc:desc="External Address Shift bit" edc:mask="0x1" edc:name="EASHFT" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Address Shifting enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Address Shifting disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ABW" edc:desc="Address Bus Width Select bits" edc:mask="0x3" edc:name="ABW" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="XM20" edc:desc="20-bit address bus" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="XM16" edc:desc="16-bit address bus" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="XM12" edc:desc="12-bit address bus" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="MM" edc:desc="8-bit address bus" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BW" edc:desc="Data Bus Width" edc:mask="0x1" edc:name="BW" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="16" edc:desc="16-bit external bus mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="8" edc:desc="8-bit external bus mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WAIT" edc:desc="External Bus Wait" edc:mask="0x1" edc:name="WAIT" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="n---n-nn" edc:cname="CONFIG3H" edc:default="0x8b" edc:desc="" edc:impl="0x8b" edc:name="CONFIG3H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x8b">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="CCP2MX" edc:desc="CCP2 Mux" edc:mask="0x1" edc:name="CCP2MX" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="PORTC" edc:desc="RC1" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PORTBE" edc:desc="RE7-Microcontroller Mode/RB3-All other modes" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ECCPMX" edc:desc="ECCP Mux" edc:mask="0x1" edc:name="ECCPMX" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="PORTE" edc:desc="Enhanced CCP1/3 [P1B/P1C/P3B/P3C] muxed with RE6/RE5/RE4/RE3" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PORTH" edc:desc="Enhanced CCP1/3 [P1B/P1C/P3B/P3C] muxed with RH7/RH6/RH5/RH4" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="MSSPMSK" edc:desc="MSSP address masking" edc:mask="0x1" edc:name="MSSPMSK" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="MSK7" edc:desc="7 Bit address masking mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="MSK5" edc:desc="5 bit address masking mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="MCLRE" edc:desc="Master Clear Enable" edc:mask="0x1" edc:name="MCLRE" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:_defeatcoercion="" edc:cname="ON" edc:desc="MCLR Enabled, RG5 Disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:_defeatcoercion="" edc:cname="OFF" edc:desc="MCLR Disabled, RG5 Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="n--n---n" edc:cname="CONFIG4L" edc:default="0x91" edc:desc="" edc:impl="0x91" edc:name="CONFIG4L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x91">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="STVREN" edc:desc="Stack Overflow Reset" edc:mask="0x1" edc:name="STVREN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:_defeatcoercion="" edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:_defeatcoercion="" edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="BBSIZ" edc:desc="Boot Block Size" edc:mask="0x1" edc:name="BBSIZ" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="BB2K" edc:desc="2K word Boot Block size" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x27" edc:endaddr="0x1000"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="BB1K" edc:desc="1K word Boot Block size" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x27" edc:endaddr="0x800"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="DEBUG" edc:desc="Background Debug" edc:isidehidden="true" edc:mask="0x1" edc:name="DEBUG" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:AdjustPoint edc:offset="1"/>
      <edc:DCRDef edc:access="nnnnnnnn" edc:cname="CONFIG5L" edc:default="0xff" edc:desc="" edc:impl="0xff" edc:name="CONFIG5L" edc:nzwidth="8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="CP0" edc:desc="Code Protect 00800-03FFF" edc:mask="0x1" edc:name="CP0" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x800" edc:checksumalgo="0x27" edc:endaddr="0x4000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CP1" edc:desc="Code Protect 04000-07FFF" edc:mask="0x1" edc:name="CP1" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x4000" edc:checksumalgo="0x27" edc:endaddr="0x8000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CP2" edc:desc="Code Protect 08000-0BFFF" edc:mask="0x1" edc:name="CP2" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x8000" edc:checksumalgo="0x27" edc:endaddr="0xC000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CP3" edc:desc="Code Protect 0C000-0FFFF" edc:mask="0x1" edc:name="CP3" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0xC000" edc:checksumalgo="0x27" edc:endaddr="0x10000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CP4" edc:desc="Code Protect 10000-13FFF" edc:mask="0x1" edc:name="CP4" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x10000" edc:checksumalgo="0x27" edc:endaddr="0x14000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CP5" edc:desc="Code Protect 14000-17FFF" edc:mask="0x1" edc:name="CP5" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x14000" edc:checksumalgo="0x27" edc:endaddr="0x18000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CP6" edc:desc="Code Protect 18000-1BFFF" edc:mask="0x1" edc:name="CP6" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x18000" edc:checksumalgo="0x27" edc:endaddr="0x1C000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CP7" edc:desc="Code Protect 1C000-1FFFF" edc:mask="0x1" edc:name="CP7" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x1C000" edc:checksumalgo="0x27" edc:endaddr="0x20000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
