balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F87K22.PIC
        <edc:SFRDef edc:access="nnnnnnn-" edc:cname="LATF" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxx-" edc:name="LATF" edc:nzwidth="8" edc:por="xxxxxxx-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LATF1" edc:desc="" edc:mask="0x1" edc:name="LATF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATF2" edc:desc="" edc:mask="0x1" edc:name="LATF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATF3" edc:desc="" edc:mask="0x1" edc:name="LATF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATF4" edc:desc="" edc:mask="0x1" edc:name="LATF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATF5" edc:desc="" edc:mask="0x1" edc:name="LATF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATF6" edc:desc="" edc:mask="0x1" edc:name="LATF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATF7" edc:desc="" edc:mask="0x1" edc:name="LATF7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATF" edc:desc="" edc:mask="0xff" edc:name="LATF" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="LATG" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---xxxxx" edc:name="LATG" edc:nzwidth="8" edc:por="---xxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATG0" edc:desc="" edc:mask="0x1" edc:name="LATG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATG1" edc:desc="" edc:mask="0x1" edc:name="LATG1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATG2" edc:desc="" edc:mask="0x1" edc:name="LATG2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATG3" edc:desc="" edc:mask="0x1" edc:name="LATG3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATG4" edc:desc="" edc:mask="0x1" edc:name="LATG4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATG" edc:desc="" edc:mask="0xff" edc:name="LATG" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATH" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="LATH" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATH0" edc:desc="" edc:mask="0x1" edc:name="LATH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATH1" edc:desc="" edc:mask="0x1" edc:name="LATH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATH2" edc:desc="" edc:mask="0x1" edc:name="LATH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATH3" edc:desc="" edc:mask="0x1" edc:name="LATH3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATH4" edc:desc="" edc:mask="0x1" edc:name="LATH4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATH5" edc:desc="" edc:mask="0x1" edc:name="LATH5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATH6" edc:desc="" edc:mask="0x1" edc:name="LATH6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATH7" edc:desc="" edc:mask="0x1" edc:name="LATH7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATH" edc:desc="" edc:mask="0xff" edc:name="LATH" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATJ" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="LATJ" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATJ0" edc:desc="" edc:mask="0x1" edc:name="LATJ0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATJ1" edc:desc="" edc:mask="0x1" edc:name="LATJ1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATJ2" edc:desc="" edc:mask="0x1" edc:name="LATJ2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATJ3" edc:desc="" edc:mask="0x1" edc:name="LATJ3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATJ4" edc:desc="" edc:mask="0x1" edc:name="LATJ4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATJ5" edc:desc="" edc:mask="0x1" edc:name="LATJ5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATJ6" edc:desc="" edc:mask="0x1" edc:name="LATJ6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATJ7" edc:desc="" edc:mask="0x1" edc:name="LATJ7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATJ" edc:desc="" edc:mask="0xff" edc:name="LATJ" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TRISA" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="111x1111" edc:name="TRISA" edc:nzwidth="0x8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISA0" edc:desc="" edc:mask="0x1" edc:name="TRISA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA1" edc:desc="" edc:mask="0x1" edc:name="TRISA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA2" edc:desc="" edc:mask="0x1" edc:name="TRISA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA3" edc:desc="" edc:mask="0x1" edc:name="TRISA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA4" edc:desc="" edc:mask="0x1" edc:name="TRISA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISA5" edc:desc="" edc:mask="0x1" edc:name="TRISA5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA6" edc:desc="" edc:mask="0x1" edc:name="TRISA6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISA7" edc:desc="" edc:mask="0x1" edc:name="TRISA7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISA" edc:desc="" edc:mask="0xff" edc:name="TRISA" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TRISB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="TRISB" edc:nzwidth="0x8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISB0" edc:desc="" edc:mask="0x1" edc:name="TRISB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB1" edc:desc="" edc:mask="0x1" edc:name="TRISB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB2" edc:desc="" edc:mask="0x1" edc:name="TRISB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB3" edc:desc="" edc:mask="0x1" edc:name="TRISB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB4" edc:desc="" edc:mask="0x1" edc:name="TRISB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB5" edc:desc="" edc:mask="0x1" edc:name="TRISB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB6" edc:desc="" edc:mask="0x1" edc:name="TRISB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB7" edc:desc="" edc:mask="0x1" edc:name="TRISB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISB" edc:desc="" edc:mask="0xff" edc:name="TRISB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TRISC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111u111" edc:name="TRISC" edc:nzwidth="0x8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISC0" edc:desc="" edc:mask="0x1" edc:name="TRISC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC1" edc:desc="" edc:mask="0x1" edc:name="TRISC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC2" edc:desc="" edc:mask="0x1" edc:name="TRISC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC3" edc:desc="" edc:mask="0x1" edc:name="TRISC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISC4" edc:desc="" edc:mask="0x1" edc:name="TRISC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC5" edc:desc="" edc:mask="0x1" edc:name="TRISC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC6" edc:desc="" edc:mask="0x1" edc:name="TRISC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC7" edc:desc="" edc:mask="0x1" edc:name="TRISC7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISC" edc:desc="" edc:mask="0xff" edc:name="TRISC" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
